<template>
    <div class="container">
        <div class="container-bg"></div>
        <div class="letter">
            <div class="title">可爱的小阿宝</div>
            <div class="article">
                <!-- <div>礼物收到了吗？喜欢吗？你肯定会喜欢的！今天是九月十号，这个日子以前对我来说只不过意味着教师节，但是遇到你之后一切都变了，因为这是你的生日。我从来没有想过这一天甚至比四月十一号还要重要很多，正如我从来没有想过我还能够在生命中遇见你。</div>
                <div>阿宝你相信吗，这世间所有的相遇都是久别重逢，遇见你真的是太美好了，遇见你之后我生活的意义就变了。我们手牵手逛玄武湖，逛商场，在新街口的地下铁里穿梭，只为了散落在各处的美食。早春三月，我们坐在玄武湖边的长椅上，我看着逆光的你，心中无比安宁，我知道，这就是爱情。</div>
                <div>爱情是那么的美好，又那么的朦胧，阿宝，是你点亮了我的生活，我承认我的古板和无趣，但是谢谢有趣又精灵的你像一束光一样照亮了我的生活。我永远记得那年你在房间门口像个精灵一样快步向前，嘴里还在呜呜着什么；我永远记得你在我身边叽叽喳喳的分享自己看见的趣闻，即便打断了我正在做的事，但是我乐在其中；我永远记得在服装店里你看完衣服走出店门之后对我娇嗔“牵手手”；我永远记得你每一次撒娇时的表情。</div>
                <div>是你让生命和时光变得美好而温柔，没有你的时间和空间都毫无意义，和你相爱是我这些年最开心的事情，遇到了困难只要看见你的笑脸，我就会融化。</div>
                <div>可惜啊，是我太笨了，我不知道该怎样说我爱你，所以我只能在情书里写给你，一个不善于表达爱意的直男程序员所能拥有的最高浪漫，就是将情书放在一个自己搭建的网站上，向全世界七十九亿人公开我的爱。</div>
                <div>就是因为我太笨了，所以经常惹你生气，过后我也相当自责，但是不管怎么样，我还是会有错没错，首先认错，听从指挥，服从命令。</div>
                <div>度过了一千多个开开心心又吵吵闹闹的日子，不知道从什么时候开始起，我渴望与你组成家庭，虽然现在还有很大的难度，但是我一直在为之努力，我坚信只要我再努力一些，我就可以为你穿上洁白的婚纱，然后一起去你想去的地方度假，我们将一起开启人生的新篇章，这样的场景仅仅是想象就让我充满干劲！</div>
                <div>阿宝，我想让你成为我的妻子，在我身边睡着，</div>
                <div>这是我们一起度过的第四个生日，</div> -->
                <div>亲爱的阿宝，请允许我很冒犯的再次这样称呼你，这大概是最后一次了，希望你原谅我。</div>
                <div>生日快乐呀阿宝，其实从七月份就一直在准备你的生日，大致流程是这样的，投影仪大概会提前一天到，然后晚上下班之后把情书的链接给你，第二天带你去逛街整整一天！然后带你去一家海鲜自助，听同事说了好久没舍得去，生日的时候带你去应该很棒。感觉自己安排的不错，应该挺浪漫的，也不知道合不合你心意。</div>
                <div>三年半前我们刚开始的时候是异地，那时候你正在考研，其实我每天都很想你，是不能表现出来，因为那样会让你更想我，会让你没有心思看书。每一次你发信息告诉我你想我的时候，我只能告诉你要乖乖看书，然后买一些甜品给你吃，我希望你保持最好的状态，不能因为我影响到学习。</div>
                <div>后来考研结束，疫情来了，不能去看你，那段时间关系很僵，不过还好没过多久你就来了南京，找到了工作，周末的时候来我家，我们一起出去逛街、吃饭，一起到处乱跑，一起打打闹闹。每次我单独出门，回来之后看着你笑着给我开门，那是我最快乐的时光，因为我知道你会在家里等我回来。</div>
                <div>日子就这样甜甜蜜蜜的过去，我们的感情越来越深，你总是看着我笑，其实你不知道，我总是看着你的背影在笑。这让我的日子很有盼头，我开始计划买房、计划结婚，我想和你度过余生。</div>
                <div>但其实也是这些计划，让我自己给了自己太大的压力，导致我忽视了你，所以今年这半年，我让你受委屈了，可我完全没有意识到，也没有弄懂问题出在哪里，所以想通过过生日的方式让你开心起来，现在弄懂了问题在哪里，但已经来不及了，不过还是决定要给你过一个生日。</div>
                <div>前前后后个把月了，很难熬，我像行尸走肉一样过了一个月，已经完全不会笑了。工作日白天都时候还好，拼命的工作把自己塞满，才能不那么想你，到了晚上只能加班或者打游戏，把时间填满，但是再满，到了睡觉的时候还是会空闲下来，每天都要到两三点才能昏迷过去，靠中午睡半小时才能缓解精神。</div>
                <div>工作日还好些，周末就难熬了，只能拼命加班，这段时间我把所有的活儿都揽下来了，才能勉强让自己不空闲。上周日实在是没事情可以做了，就想去看看你，但没想到你会那么害怕我，很难受很伤心。我没有想对你做什么，我也不会对你做什么，我绝不会伤害你。我甚至都没有想上楼，只想远远的看你一眼，坐在朱靖车里听说你害怕我的时候，差点没忍住哭出来。</div>
                <div>他也跟我说了很多，也让我知道，不管我再多么希望回到从前，希望重新开始，你的态度都是那么坚决。</div>
                <div>现在中午也睡不着了，我感觉自己很糟糕，所以今天早上偷偷去挂了个心理门诊，医生说有可能会发展成抑郁，建议我做一次深入的交流，尽量打开心结。我知道你害怕看见我，所以想通过过生日这种方式来打开心结，无论后面你会怎么想怎么做，但总算是了了我的一个心愿，一个执念。</div>
                <div>请你相信我，无论我是什么样的人，我们是什么关系，我都不可能会伤害你，我愿意用一切换你回来。但请放心，没有你的允许我不会再去找你了，我不想让你感到恐惧害怕。</div>
                <div>我让他们帮忙把海绵宝宝和手帐本带给你了。海绵宝宝是我们第一次见面的时候你送给我的，你说见到它就会想起你，就像看到你，它会陪着我。</div>
                <div>确实是这样，这段时间我每天晚上都抱着它哭。还有手帐本，里面夹着你送给我的各种生日呀、程序员节等等小礼品里夹带的纸片，我一直都藏着。海绵宝宝我洗干净了，现在我把它们都还给你，我不敢再看它们。</div>
                <div>我知道应该怎么做了，我应该更心细，应该更耐心，应该在你需要我的时候站出来，应该给你带一枝花，应该随时给你一些小惊喜，应该让你开心，应该浪漫和有趣还有幽默，应该满足你的小要求，应该表达出我的感情，但我也知道你不会再回来了，无论我做什么说什么。</div>
                <div>我想用投影仪这些东西弥补你，也想告诉你，这次之后我真的彻底改变了，我会变得很好的。</div>
                <div>三年半的时间，就像是一场梦。其实就像周星驰说的，我曾经有一份真挚的爱情，如果能再来一次，我希望是一万年。</div>
                <div>即便我再想你，我也不敢幻想着你再联系我，只要知道你过得好，我就很开心了。</div>
                <div>我好想继续爱你，再爱一次，轰轰烈烈，把我的一切都给你。</div>
                <div>我知道，不管我怎么说怎么做，你都不想继续了，不管我说什么做什么都只会让你害怕厌烦，但无论如何，我还是想说一句</div>
                <div>生日快乐呀阿宝～</div>
            </div>
        </div>
    </div>
</template>

<script>
export default {
};
</script>

<style scoped>
body {
    overflow: hidden;
}
.container {
    width: 100vw;
    height: 100vh;
    display: flex;
    flex-direction: row;
    justify-content: center;
    align-items: center;
    overflow: hidden;
}
.container-bg {
    width: 100vw;
    height: 100vh;
    background: linear-gradient(to right, rgb(90, 90, 235) 50%, rgb(247, 245, 218) 50%);
    background-size: 27px 100%;
    transform: scale(2.2) rotate(-50deg);
    position: relative;
    z-index: -1;
    overflow: hidden;
}
.letter {
    width: calc(100vw - 70px);
    height: calc(100vh - 120px);
    background: url('/public/yamase.png') no-repeat 100%;
    position: absolute;
    padding: 40px 20px;
    overflow-y: scroll;
    text-align: left;
}
.title {
    font-size: 20px;
    font-weight: bold;
    margin: 10px 0;
}
.article > div {
    font-size: 18px;
    text-indent: 2em;
    margin-bottom: 10px;
    font-weight: 500;
}
</style>
